marcelky/GPS-proj/stm32_sim808_eclipse.cpp
// Do not remove the include below

/*********************************************************PIN # ***/
//    {&gpioa, &timer2, &adc1,  0, 1,    0}, /* PA0  */    0
//    {&gpioa, &timer2, &adc1,  1, 2,    1}, /* PA1  */    1
//    {&gpioa, &timer2, &adc1,  2, 3,    2}, /* PA2  */    2
//    {&gpioa, &timer2, &adc1,  3, 4,    3}, /* PA3  */    3
//    {&gpioa,   NULL, &adc1,  4, 0,    4},  /* PA4  */    4
//    {&gpioa,   NULL, &adc1,  5, 0,    5},  /* PA5  */    5
//    {&gpioa, &timer3, &adc1,  6, 1,    6}, /* PA6  */    6
//    {&gpioa, &timer3, &adc1,  7, 2,    7}, /* PA7  */    7
//    {&gpioa, &timer1, NULL,  8, 1, ADCx},  /* PA8  */    8
//    {&gpioa, &timer1, NULL,  9, 2, ADCx},  /* PA9  */    9
//    {&gpioa, &timer1, NULL, 10, 3, ADCx},  /* PA10 */    10
//    {&gpioa, &timer1, NULL, 11, 4, ADCx},  /* PA11 */    11
//    {&gpioa,   NULL, NULL, 12, 0, ADCx},   /* PA12 */    12
//    {&gpioa,   NULL, NULL, 13, 0, ADCx},   /* PA13 */    13
//    {&gpioa,   NULL, NULL, 14, 0, ADCx},   /* PA14 */    14
//    {&gpioa,   NULL, NULL, 15, 0, ADCx},   /* PA15 */    15
//    {&gpiob, &timer3, &adc1,  0, 3,    8}, /* PB0  */    16
//    {&gpiob, &timer3, &adc1,  1, 4,    9}, /* PB1  */    17
//    {&gpiob,   NULL, NULL,  2, 0, ADCx},   /* PB2  */    18
//    {&gpiob,   NULL, NULL,  3, 0, ADCx},   /* PB3  */    19
//    {&gpiob,   NULL, NULL,  4, 0, ADCx},   /* PB4  */    20
//    {&gpiob,   NULL, NULL,  5, 0, ADCx},   /* PB5  */    21
//    {&gpiob, &timer4, NULL,  6, 1, ADCx},  /* PB6  */    22
//    {&gpiob, &timer4, NULL,  7, 2, ADCx},  /* PB7  */    23
//    {&gpiob, &timer4, NULL,  8, 3, ADCx},  /* PB8  */    24
//    {&gpiob, &timer4, NULL,  9, 4, ADCx},  /* PB9  */    25
//    {&gpiob,   NULL, NULL, 10, 0, ADCx},   /* PB10 */    26
//    {&gpiob,   NULL, NULL, 11, 0, ADCx},   /* PB11 */    27
//    {&gpiob,   NULL, NULL, 12, 0, ADCx},   /* PB12 */    28
//    {&gpiob,   NULL, NULL, 13, 0, ADCx},   /* PB13 */    29
//    {&gpiob,   NULL, NULL, 14, 0, ADCx},   /* PB14 */    30
//    {&gpiob,   NULL, NULL, 15, 0, ADCx},   /* PB15 */    31
//    {&gpioc,   NULL, NULL, 13, 0, ADCx},   /* PC13 */    32
//    {&gpioc,   NULL, NULL, 14, 0, ADCx},   /* PC14 */    33
//    {&gpioc,   NULL, NULL, 15, 0, ADCx},   /* PC15 */    34
/*******************************************************************/

#include "stm32_sim808_eclipse.h"
#include <stdlib.h>

#define DEBUG 1
//#define NO_NETLIGHT 1   //turn on or off netlight of sim808 board
#define PROTOCOL 2        //1 = TCP and 2 = UDP

#ifdef PROTOCOL
  static int const prot = PROTOCOL;
#else
  static int const prot = 1;          // default value TCP
#endif

#define Powerkey 28      //pin PB12 Power pin for SIM808
//int DTRkey=8;          //pin 8 of arduino will be connected to DTR of SIM808 pin (9)
//#define rxPin 27       //pin PB11
//#define txPin 26       //pin PB10

fault_type currentError; //if value 0, there is no error, otherwise check the "Definition of error codes"

const int ERROR_SIZE = 25;
int errorStatus[ERROR_SIZE]={0};

// start reading from the first byte (address 0) of the EEPROM
int addWrite = 0; //write
int addRead = 0;  //position to read from EEPROM

//The content of messages sent
//#define MESSAGE  "hello,world"
#define MESSAGE_LENGTH 30
char message[MESSAGE_LENGTH];

char phone[16];
char datetime[24];
char gprsBuffer[64];
char *s = NULL;
char smsMessage[64];

//SoftwareSerial GPRS(rxPin, txPin); // RX, TX
//DFRobot_SIM808 sim808(&GPRS);
int timerID;

//All this char variable have reserved one extra char to insert \0 at end
char gpsMode[4]="000";
char dateTime[11]="000000.000";
char latitude[10]="0000.0000";
char north_south[2]="N";
char longitude[11]="00000.0000";
char east_west[2]="W";
char MSL_altitude[8]="00000.0";
char Speed[8]="000.000";
char GEOID[5]="\0";
char startDateTime[22] = "000000000000000000000";//"hhmmss.sss-dd-mm-yyyy"; start time of HW

boolean DNS_OK = true;
int currentRadioSig = 10;   //currentRadioSig/previousRadioSig = 10 to avoid configure again the data connection
int previousRadioSig = 10;  //when enter the first time of loop to send data
//USED FOR EEPROM
int addr = 0;

//time to GPS acquire signal
int timeGetGPS=0;  //in seconds
const int BUFFER_SIZE = 90;

char buffer[20];                 // WHAT WE ARE READING INTO
int posBuf;
int seconds=0;

char celularDateTime[22]={0};

//Used inside the timer
volatile boolean triggerGetGPSLocation = true;   //variable changed inside the timer(2), so need to be volatile
                                                 //it is the main loop to on/off the getGPSLocation()
volatile boolean triggerConnectGPS = true;

volatile boolean Tmachine1 = true;
volatile boolean Tmachine2 = true;
volatile boolean Tmachine3 = true;
volatile boolean Tmachine4 = true;



HardwareTimer timer_GetGPSLocation(2);
HardwareTimer timer_ConnectGPS(3);
HardwareTimer timer_GPS_machine(4);

int timeStartGetGPSLocation = 0;
int timeExecuteGetGPSLocation = 0;

DFRobot_SIM808_stm32 sim808(&Serial2);

/*******************************************************************************************
 * function setup()
 * This function run once at start up of processor, here is made the configuration of
 * UNO and SIM808.
 *******************************************************************************************/
void setup() {

/************************************
 * Define Serial parameters
 ************************************/
  Serial.begin(9600);
  Serial2.begin(9600);
  sim808_init(&Serial2,9600);
//  DFRobot_SIM808_stm32 sim808(&Serial2);
/*************************************
 * Power on the module SIM808
 *************************************/
  pinMode(Powerkey,OUTPUT);
  PowerSIM808();

/*************************************
 * Check start sequence of SIM808
 *************************************/
  Serial.println("Starting.");
  //loop to wait serial become available
  while(!Serial2.available()){
    Serial.print(".");
    delay(1000);
  }

  if((sim808_init_check())==false) {
    Serial.println();
    Serial.println("Initialization Failed.");
    printAllError();
  }else{
    Serial.println();
    Serial.println("Initialization Check Successful !!");
  }
  /*****************************************************
  * Enable charging battery
  ****************************************************/
  //sim808_send_cmd("AT+ECHARGE=1");


   /******************************************************
   * GPRS Configuration
   ******************************************************/
  //delay(5000);//try to save battery burst
  //GNSS power control
  sim808_check_with_cmd("AT+CGNSPWR=1","OK\r\n",CMD);
  //delay(5000);

  //GNSS navitation, GEO-Fence and speed alarm URC report control
  sim808_check_with_cmd("AT+CGNSURC=0","OK\r\n",CMD);
  //delay(5000);

  //GSM and GPRS configuration
  //check which network GPRS module is connected with
  //GPRS.println("AT+COPS?");

