marcelky/GPS-proj/stm32_sim808_eclipse.cpp
  //check if mobile number is register in the network
  //GPRS.println("AT+CREG=?");

  /*******************************************************
   * configuration of GPRS data
   *******************************************************/
  currentError=InitGPRS(FIRST_TIME);
  if(currentError != NO_ERROR){
    Serial.println("Error: ");
    Serial.println(currentError);
  }

  /*************************************************
   * Special config for SMS and voice call
   *************************************************/
  //PARAM FOR SMS AND RECEIVE CALL
  if(!sim808_check_with_cmd("AT+CMGF=1\r\n","OK\r\n",CMD)){ //Set SMS for text mode not HEX when read it
    delay(1);//Serial.println("fail CMGF");
  }else {
    delay(1);//Serial.println("ok CMGF");
  }
  delay(25);

  if(!sim808_check_with_cmd("AT+CMGDA=\"DEL ALL\"\r\n","OK\r\n",CMD)){ //delete all SMS
    delay(1);//Serial.println("fail del SMS");
  }else {
    delay(1);//Serial.println("ok del SMS");
  }
  delay(25);

  sim808_check_with_cmd("AT+CLIP=1\r\n","OK\r\n",CMD);
  delay(25);

  //turn off netlight of sim808
  #ifdef NO_NETLIGHT
    sim808_send_cmd("AT+CNETLIGHT=0\r\n");
  #endif


  /***********************************************************
  * GPS configuration
  ***********************************************************/
  //connect_GPS(240, FIRST_TIME);  //wait GPS connect 2minutes

  if(!GPSAnalyzer128()){ // Get current time from GPS
    setCurrentError(INITIAL_TIME_NOT_SET);
    printAllError();
  }else{
    Serial.println(startDateTime);
  }


/*****************************************************************************************
 *Configure SIM808 to power save mode, AT+CSCLK.
 *It can exit sleep mode  Configure SIM808
 * Pull down DTR
 * Receive voice or data call from network
 * Receive SMS from network
 * Receive external interrupt
 * Charge VBUS pin
 * AT+CSCLK=0 disable slow clock
 *          1 enable slow clock controlled by DTR. when DTR=1 can enter sleep mode
 *                                                 when DTR=0 exit sleep mode
 *****************************************************************************************/
  //configure DTR pin to normal HIGH
//  pinMode(DTRkey, OUTPUT);
//  digitalWrite(DTRkey, LOW);      //can not enter sleep mode

  //sim808_check_with_cmd("AT+CSCLK=1\r\n","OK\r\n",CMD);  //activate the sleep mode

  //GetGPSLocation();

  /*************************************************************************************************
   * Configure timer 6 to fire up the execution of GetGPSLocation()
   *************************************************************************************************/

  timer_GetGPSLocation.pause();
  timer_GetGPSLocation.setPeriod(30000000);                           // Set up periodin microseconds
  timer_GetGPSLocation.setChannel1Mode(TIMER_OUTPUT_COMPARE);         // Set up an interrupt on channel 1
  timer_GetGPSLocation.setCompare(TIMER_CH1, 1);                      // Interrupt 1 count after each update
  timer_GetGPSLocation.attachCompare1Interrupt(handlerGetGPSLocation);
  timer_GetGPSLocation.refresh();                                     // Refresh the timer's count, prescale, and overflow
  //timer_GetGPSLocation.resume();                                      // Start the timer counting

  timer_ConnectGPS.pause();
  timer_ConnectGPS.setPeriod(30000000);                       		// Set up periodin microseconds
  timer_ConnectGPS.setChannel1Mode(TIMER_OUTPUT_COMPARE);     		// Set up an interrupt on channel 1
  timer_ConnectGPS.setCompare(TIMER_CH1, 1);                  		// Interrupt 1 count after each update
  timer_ConnectGPS.attachCompare1Interrupt(handlerConnectGPS);
  timer_ConnectGPS.refresh();                                 		// Refresh the timer's count, prescale, and overflow
  //timer_ConnectGPS.resume();                                  		// Start the timer counting

  //TODO create timer to set clock
  timer_GPS_machine.pause();
  //timer_GPS_machine.setPeriod(30000000);    // Set up periodin microseconds
  timer_GPS_machine.setOverflow(60000);     // max time 30s
  timer_GPS_machine.setPrescaleFactor(36000);  //72000000/36000 = 2000 Hz new frequency after pre-scaler

  timer_GPS_machine.setChannel1Mode(TIMER_OUTPUT_COMPARE);
  timer_GPS_machine.setChannel2Mode(TIMER_OUTPUT_COMPARE);
  timer_GPS_machine.setChannel3Mode(TIMER_OUTPUT_COMPARE);
  timer_GPS_machine.setChannel4Mode(TIMER_OUTPUT_COMPARE);


  timer_GPS_machine.setCompare(TIMER_CH1,1);
  timer_GPS_machine.setCompare(TIMER_CH2,10000); //2000 * 5sec = 10000
  timer_GPS_machine.setCompare(TIMER_CH3,20000); //2000 * 10sec = 20000
  timer_GPS_machine.setCompare(TIMER_CH4,40000); //2000 * 20sec = 40000

  timer_GPS_machine.attachInterrupt(TIMER_CH1,ClockSeconds);
  timer_GPS_machine.attachInterrupt(TIMER_CH2,handlerMachine2);
  timer_GPS_machine.attachInterrupt(TIMER_CH3,handlerMachine3);
  timer_GPS_machine.attachInterrupt(TIMER_CH4,handlerMachine4);

  timer_GPS_machine.refresh();                                 		// Refresh the timer's count, prescale, and overflow
  timer_GPS_machine.resume();                                  		// Start the timer counting

  //TODO criar timers para fazer fech the estado do GPS


  //TODO criar relogios para fazer o chaveamento do GPS

}



/***********************************************************************************
 * Main Loop, this funcion runs over and over again forever
 ***********************************************************************************/
void loop() {
//  digitalWrite(PC13, HIGH);   // turn the LED on (HIGH is the voltage level)
//  delay(1000);                       // wait for a second
//  digitalWrite(PC13, LOW);    // turn the LED off by making the voltage LOW
//  delay(1000);                       // wait for a second

  //Only for debug purpose, send directly the AT command manually via serial interface
  #ifdef DEBUG
  if(Serial2.available())
    Serial.write(Serial2.read());
  if(Serial.available())
    Serial2.write(Serial.read());
  #endif

  /***********************************************
   * Main code to get GPS information
   ***********************************************/


//    if(sim808.getDateTime(celularDateTime)){
//      Serial.println();
//      Serial.println();
//      Serial.println(celularDateTime);
//
//      Serial.print("triggerGetGPSLocation: ");
//      Serial.println(triggerGetGPSLocation);
//
//      Serial.print("triggerConnectGPS: ");
//      Serial.println(triggerConnectGPS);
//
//      Serial.print("timer_GetGPSLocation: ");
//      Serial.println(timer_GetGPSLocation.getCount());
//
//      Serial.print("timer_ConnectGPS: ");
//      Serial.println(timer_ConnectGPS.getCount());
//    }


