marcelky/GPS-proj/stm32_sim808_eclipse.cpp
  //TODO check period of timer no serial monitor, pois nao esta aparecendo nada do machine1 2 3 4
  if (Tmachine1 == true){
	Tmachine1 = false;
	Serial.print("Machine1: ");
	//Serial.println(timer_GPS_machine.getCount());
  }

  if (Tmachine2 == true){
	Tmachine2 = false;
	Serial.print("Machine2: ");
	//Serial.println(timer_GPS_machine.getCount());
  }

  if (Tmachine3 == true){
	Tmachine3 = false;
	Serial.print("Machine3: ");
	//Serial.println(timer_GPS_machine.getCount());
  }

  if (Tmachine4 == true){
	Tmachine4 = false;
	Serial.print("Machine4: ");
	//Serial.println(timer_GPS_machine.getCount());
  }





  if (triggerGetGPSLocation==true){
    timeStartGetGPSLocation = millis();
    timer_GetGPSLocation.pause();

    GetGPSLocation();
    triggerGetGPSLocation = false;
    timer_GetGPSLocation.resume();

    timeExecuteGetGPSLocation = ((unsigned long) (millis() - timeStartGetGPSLocation))/1000UL;

    Serial.print("timeExecuteGetGPSLocation: ");
    Serial.println(timeExecuteGetGPSLocation);
  }
  currentError = (fault_type)readCurrentError(GPS_SYNC_FAIL);
  if ((currentError == 1) && (triggerConnectGPS==true)){
    timer_GetGPSLocation.pause();                             //timer_GetGPSLocation getGPSLocation disabled
    triggerGetGPSLocation = false;                            //it only toggle to true inside the handler3() with timer(2) enabled
    Serial.println("GetGPSDisabled");

    if(connect_GPS(120, RUNNING_TIME)){    //leave GPS ON/COLD START until timeout of 120 sec the function connect_GPS disable alarm GPS_SYNC_FAIL if sync
      timer_GetGPSLocation.resume();                          //timer getGPSLocation enabled
      timer_ConnectGPS.pause();                               //timer connectGPS disabled, this routine only run again here in case of GPSsync timeout
      Serial.println("GetGPSEnabled");
    }else{                                                    //still fault GPSsync so prepare to run again next cyclo
      timer_ConnectGPS.refresh();                             //timer connectGPS restart/enabled
      timer_ConnectGPS.resume();
      Serial.println("GetGPSDisabled");
      triggerConnectGPS=false;                                //trigger_connectGPS will only be activate again in handlerConnectGPS
    }
    sim808_check_with_cmd("AT+CGPSPWR=0\r\n","OK\r\n",CMD);   //put GPS to sleep either have acquired signal or not
  }
}

/****************************************************************************************
 * power()
 * Function power on or power of SIM808.
 ****************************************************************************************/
void PowerSIM808(){
  digitalWrite(Powerkey, LOW);
  delay(1000);               // wait for 1 second
  digitalWrite(Powerkey, HIGH);
}

/***************************************************************************************
 * This function SET/UNSET the trigger of function getGPSLocation in the main loop
 * It is called from timer(1) function.
 * It is necessary because the delay() or millis() function does not work if called
 * directly from the timer(1) function. This is a limitation of timer functionality.
 ***************************************************************************************/
void handlerGetGPSLocation(){
  if (triggerGetGPSLocation == true){
    triggerGetGPSLocation = false;
    digitalWrite(PC13, HIGH);
  }else{
    triggerGetGPSLocation = true;
    digitalWrite(PC13, LOW);
  }
}

/***************************************************************************************
 * This function SET/UNSET the trigger of function connectGPS in the main loop
 * It is called from timer(2) function.
 * It is necessary because the delay() or millis() function does not work if called
 * directly from the timer(2) function. This is a limitation of timer functionality.
 ***************************************************************************************/
void handlerConnectGPS(){
  if (triggerConnectGPS == true){
    triggerConnectGPS = false;
  }else{
    triggerConnectGPS = true;
  }
}

/****************************************************************************************
 * Create handler for GPS machine
 ****************************************************************************************/
void ClockSeconds(){
	Serial.print("Machine1: ");
	Tmachine1 = true;
	//Serial.println(timer_GPS_machine.getCount());
}

void handlerMachine2(){
	Serial.print("Machine2: ");
	Tmachine2 = true;
	//Serial.println(timer_GPS_machine.getCount());
}

void handlerMachine3(){
	Serial.print("Machine3: ");
	Tmachine3 = true;
	//Serial.println(timer_GPS_machine.getCount());
}

void handlerMachine4(){
	Serial.print("Machine4: ");
	Tmachine4 = true;
	//Serial.println(timer_GPS_machine.getCount());
}

//TODO criar rotina para fazer single status of GPS



/****************************************************************************************
 * sim808_init_check
 * Check if initialization of SIM808 was successfull
 * -Check AT command
 * -Check CFUN=1 (full functionality, SMS and voice are working)
 * -Check CPIN, if SIM card is operational
 *
 *  Normal messages during start of SIM808
 *  NORMAL POWER DOWN
 *  RDY
 *  +CFUN: 1
 *  +CPIN: READY
 *  Call Ready
 *  SMS Ready
 ****************************************************************************************/
boolean sim808_init_check(){
boolean checkOK=true;
byte i;

  for(i=0;i<10; i++){
    if(!sim808_check_with_cmd("AT\r\n","OK\r\n",CMD)){
      if(i==9){
        setCurrentError(SIM808_SERIAL_FAILED);
        return false;
      }
//      Serial.print("AT_F:");
//      Serial.println(i);
      //delay(1000);
    }else{
//      Serial.print("AT_OK:");
//      Serial.println(i);
      break;
    }
  }


  sim808_clean_buffer(gprsBuffer,64);
  sim808_flush_serial();
  sim808_send_cmd("AT+CFUN?\r\n");
  sim808_read_buffer(gprsBuffer,25,30);
  if(!(strstr(gprsBuffer,"+CFUN: 1"))){
    setCurrentError(CFUN1_FAILED);
    checkOK = false;
  }
//  Serial.print("Buffer01: ");
//  Serial.println(gprsBuffer);
//  Serial.print("**********");


