marcelky/GPS-proj/stm32_sim808_eclipse.cpp
  for(i=0;i<10; i++){
    sim808_clean_buffer(gprsBuffer,64);
    sim808_flush_serial();
    sim808_send_cmd("AT+CPIN?\r\n");
    sim808_read_buffer(gprsBuffer,25,30);
    if(!(strstr(gprsBuffer,"+CPIN: READY"))){
      Serial.print("CPIN_F:");
      Serial.println(i);
      if(i==9) {
        setCurrentError(CPIN_SIMCARD_FAILED);
        checkOK = false;
        break;
      }
      delay(1000);
    }else{
        Serial.print("CPIN_OK:");
        Serial.println(i);
        break;
    }
  }

//  Serial.print("Buffer02: ");
//  Serial.println(gprsBuffer);
//  Serial.print("**********");


  return checkOK;
}



/**************************************************************************************
* InitGPRS(byte firstTime)
* This function initialize the GPRS during start/restart of arduino/sim808 or when
* during normal operation it lost connection signal with GPRS.
* param: firstTime = 1, when is called during setup()
*        firstTime = 0, when called inside the code
* Return error code: see error definition
***************************************************************************************/
fault_type InitGPRS(initTime_type t){
 fault_type error = NO_ERROR;
 /**************************************
  *AT+CGREG?
  *Request Network registration status
  *Response:
  *+CGREG: 0,1   //1 indicate registered
  *OK
  *************************************/
  //GPRS.println("AT+CGREG?");

  /************************************
   *AT+CGATT?
   *Attach or detach from GPRS service
   *Response:
   *+CGATT: 1
   *OK
   ************************************/
   //GPRS.println("AT+CGATT?");

   /************************************
    *AT+CIPSHUT
    *Detach PDP context
    *OK
    ************************************/

   sim808_check_with_cmd("AT\r\n","OK\r\n",CMD);

   if(t==FIRST_TIME){
     if(!sim808_check_with_cmd("AT+CIPSHUT\r\n","OK\r\n",CMD)){
       error = CIPSHUT_FAIL;
       setCurrentError(CIPSHUT_FAIL);
     }else{
       clearCurrentError(CIPSHUT_FAIL);
     }
     delay(50);
   }

  /***********************************
   *Set GPRS data rate
   *AT+IPR=9600
   *OK
   ***********************************/
   if(!sim808_check_with_cmd("AT+IPR=9600\r\n","OK\r\n",CMD)){
     error = IPR9600_FAIL;
     setCurrentError(IPR9600_FAIL);
     //Serial.println("IPR9600_FAIL");
   }else{
     clearCurrentError(IPR9600_FAIL);
   }
   delay(50);

  /******************************************
   *Set the APN id to connect to gprs network
   *China UNICOM = UNINET
   *AT+CSTT="UNINET"
   *OK
   ******************************************/
  if(!sim808_check_with_cmd("AT+CSTT=\"UNINET\"\r\n","OK\r\n",CMD)){
    error = CSTT_UNINET_FAIL;
    setCurrentError(CSTT_UNINET_FAIL);
    //Serial.println("CSTT_UNINET_FAIL");
  }else{
    clearCurrentError(CSTT_UNINET_FAIL);
  }
  delay(50);

  /*******************************************
   *bring up the wireless connection with GPRS
   *AT+CIICR
   *OK
   *******************************************/
  if(!sim808_check_with_cmd("AT+CIICR\r\n","OK\r\n",CMD)){
    error = CIICR_FAIL;
    setCurrentError(CIICR_FAIL);
  }else{
    clearCurrentError(CIICR_FAIL);
  }
  delay(50);

  /*******************************************
   *get the local ip number
   *AT+CIFSR
   *10.x.x.x
   *******************************************/
  sim808_send_cmd("AT+CIFSR\r\n");
  delay(50);

  /*******************************************
   *Get the remote IP address
   *AT+CDNSGIP="ardugps.hopto.org"
   *OK
   *+CDNSGIP: 1,"ardugps.hopto.org","58.100.82.70"
   *******************************************/
  if(!sim808_check_with_cmd("AT+CDNSGIP=\"ardugps.hopto.org\"\r\n","OK\r\n",CMD)){
    error = CDNSGIP_FAIL;
    setCurrentError(CDNSGIP_FAIL);
  }else{
    clearCurrentError(CDNSGIP_FAIL);
  }
  delay(50);
  return error;
}



/****************************************************************************************
* extractCallingNumber(char *messages)
* This function when an incoming call come and CLIP is enabled, it will prompt at serial
* the message:
*   RING
*
*   +CLIP: "18968192062",161,"",0,"",0
*
* Here we extract the phone number
*****************************************************************************************/
boolean extractCallingNumber(char *inMessage){
char *token;

   /* get the first token */
   //Serial.println("valor do buffer :");
   //Serial.println(inMessage);

   if(NULL == strstr(inMessage,"+CLIP")){
     return false;
   }

   //Get Command sent
   token = strtok(inMessage,"\n\r" );
   if(token == NULL)  return false;

   //Get "+CLIP: " string
   token = strtok(NULL, "\"");
   if(token == NULL)  return false;

   //Get phone number value
   token = strtok(NULL, "\"");
   if(token != NULL) {
      strncpy(phone,token,sizeof(phone));
      phone[sizeof(phone)-1] = '\0';

      //strcpy(gpsMode,token);
//      Serial.print("ph#: ");
//      Serial.println(phone);
   }else return false;

   return true;

}

/****************************************************************************************
* extractCallingNumberSMS(char *messages)
* This function when receive an SMS extract the calling number from SMS.
* AT+CMGR=#           //read the message #
*
* +CMGR: "REC READ","18968192062","","17/10/14,14:07:10+32"*
*
* Here we extract the phone number
*****************************************************************************************/
boolean extractCallingNumberSMS(char *inMessage){
char *token;
char temp[16];



   /* get the first token */
   //Serial.println("valor do buffer :");
   //Serial.println(inMessage);

   if(NULL == strstr(inMessage,"+CMGR")){
     return false;
   }

   //Get Command sent
   token = strtok(inMessage,"\n\r" );
   if(token == NULL)  return false;

   //Get "+CMGR:" string
   token = strtok(NULL, ":");
   if(token == NULL)  return false;

   //Get type of SMS "REC READ" or other type not important here
   token = strtok(NULL, ",");
   if(token == NULL)  return false;



