marcelky/GPS-proj/stm32_sim808_eclipse.cpp
   //Get phone number value
   token = strtok(NULL, ",");
   if(token != NULL) {
      //removing the " at begining and end of phone number
      //token = phone;
      token++;
      token[strlen(token)-1]='\0'; //now the " is not at beginning/end of toke and in phone either

      strncpy(phone,token,sizeof(phone));
      phone[sizeof(phone)-1] = '\0';

      //getAllButFirstAndLast(token,phone);


      //strcpy(gpsMode,token);
//      Serial.print("ph#: ");
//      Serial.println(phone);
   }else return false;

   return true;

}

/*************************************************************************************************
*  getAllButFirstAndLast(const char *input, char *output)
*  Ths procedure remove the first and last character of char array
*  "12938484848"
*  for exemplo for a phone number
************************************************************************************************/
void getAllButFirstAndLast(const char *input, char *output){
  int len = strlen(input);
  if(len > 0)
    strcpy(output, ++input);
  if(len > 1)
    output[len - 2] = '\0';
}



/****************************************************************************************
 * DTR_low50ms()
 * Function power on or power of SIM808.
 ****************************************************************************************/
//void DTR_low50ms(void)
//{
//  digitalWrite(DTRkey, LOW);
//  delay(50);               // wait for 1 second
//  digitalWrite(DTRkey, HIGH);
//}


/****************************************************************************************
 * powerGPS(int onOff)
 * This procedure power on GPS 1, power on and 0 power off.
 ****************************************************************************************/
/*boolean powerGPS(int onOff){
  if (onOff == 1)
    if(!sim808_check_with_cmd("AT+CGNSPWR=1\r\n", "OK\r\n", CMD)) return false;
  else
    if(!sim808_check_with_cmd("AT+CGNSPWR=0\r\n", "OK\r\n", CMD)) return false;

  return true;
}*/

/****************************************************************************************
 * GetGPSLocation()
 * This function request the GPS information from SIM808, parse information in global
 * variables and finally print the information at Serial interface for debugging.
 ****************************************************************************************/
void GetGPSLocation(){
char infoLocation[BUFFER_SIZE];


//  digitalWrite(DTRkey, LOW);  //exit sleep mode
//  delay(50);                  //time to exit sleep mode
//
  //sim808_send_cmd("AT+CFUN=1\r\n");


  //readAllError();  //print all errors present in the previous loop

  //  //waking up GPS after sleep
  //if(!connect_GPS(25, RUNNING_TIME)){ //timeout of 25 seconds to acquire signal, 1h worst case lost 2x

  Serial.println("*******************LOOP********************");

  //timer.pause(); //pause interruption of this function while executing it.

  if(!connect_GPS(30, RUNNING_TIME)){ //timeout of 25 seconds to acquire signal, 1h worst case lost 2x
    sim808_check_with_cmd("AT+CGPSPWR=0\r\n","OK\r\n",CMD);
    setCurrentError(GPS_SYNC_FAIL);
    printAllError();

    //timer.resume(); //resume interruption of this function.
    return; //   GPS_SYNC_FAIL;
  }



//  sim808_clean_buffer(infoLocation,BUFFER_SIZE);
//  sim808_send_cmd("AT+CGPSINF=2\r\n");
//  sim808_read_buffer(infoLocation,BUFFER_SIZE,DEFAULT_TIMEOUT);

//Routine to try to avoid error of NO_GPS_DATA_AVAILABLE, try to fetch 3x times
  for(int i=0;i<3; i++){
    sim808_clean_buffer(infoLocation,BUFFER_SIZE);
    sim808_flush_serial();
    sim808_send_cmd("AT+CGPSINF=2\r\n");
    sim808_read_buffer(infoLocation,BUFFER_SIZE,DEFAULT_TIMEOUT);
    if(!(strstr(infoLocation,"+CGPSINF: 2")) || (strstr(infoLocation,"0000.0000,N,00000.0000,E"))){
      Serial.print("NO GPS DATA: ");
      Serial.println(i);
      Serial.println(infoLocation);
      if(i==2) {
        setCurrentError(NO_GPS_DATA_AVAILABLE);
        printAllError();
        return;
      }
      delay(1000);
    }else{
        Serial.print("GPS DATA_OK: ");
        Serial.println(i);
        Serial.println(infoLocation);
        break;
    }
  }

//  Serial.println("buffer2:");
//  Serial.println(infoLocation);


  if(!GPSAnalyzer(infoLocation)){                   //power off GPS and wait another loop of getGPSLocation to turn GPS on again
    //sim808_clean_buffer(infoLocation,BUFFER_SIZE);
    sim808_check_with_cmd("AT+CGPSPWR=0\r\n","OK\r\n",CMD);

    setCurrentError(NO_GPS_DATA_AVAILABLE);
    printAllError();
    //Serial.println("GPSAnalyzer failed");
    //timer.resume(); //resume interruption of this function.
    return; // NO_GPS_DATA_AVAILABLE;

  }

//


  //Send collected data to mysql server



  currentError = SendGPSLocation();  //error already saved inside the SendGPSLocation()

  Serial.print("ERROR:");
  Serial.println(currentError);
  //createSMSMessage(smsMessage,latitude, longitude, MSL_altitude, Speed);

  //put GPS to sleep
  sim808_check_with_cmd("AT+CGPSPWR=0\r\n","OK\r\n",CMD);

  //test if make difference1
  sim808_check_with_cmd("AT+CGNSPWR=0\r\n", "OK\r\n", CMD);

  //delay(5000);


  printAllError();

  //sim808_send_cmd("AT+CFUN=4\r\n");
//  Serial.println("DTR high");
//  digitalWrite(DTRkey, HIGH); //can enter sleep mode

  //timer.resume(); //resume interruption of this function.
  return; // 0; //success

}


/****************************************************************************
 * setCurrentError(enum fault)
 * param
 * error = is the error code (position in the array)
 *  ****************************************************************************/
 void setCurrentError(fault_type currentError){
   errorStatus[NO_ERROR]=1;
   errorStatus[currentError]=1;
}

/****************************************************************************
 * clearCurrentError(enum fault)
 * param
 * error = is the error code (position in the array)
 *  ****************************************************************************/
 void clearCurrentError(fault_type error){
   errorStatus[error]=0;
}

/****************************************************************************
 * clearAllError()
 * param
 * error = is the error code (position in the array)
 *  ****************************************************************************/
 void clearAllError(){

