marcelky/GPS-proj/stm32_sim808_eclipse.cpp
  //memset(errorStatus, 0, ERROR_SIZE);
  for(int i=0; i<ERROR_SIZE;i++){
    errorStatus[i]=0;
  }
}

/****************************************************************************
 * readErrorStatus(enum fault)
 * readu current error
 ****************************************************************************/
 int readCurrentError(fault_type error){
   return errorStatus[error];
 }

/****************************************************************************
 * printAllError()
 ****************************************************************************/
void printAllError(){
   int i;
   boolean first = true;
//   addWrite = EEPROMReadInt(0);               //position 0 always have the last position to write data
//   addWrite=storeString(addWrite,"L");   //store letter 'L' of Loop to indicate init of one loop


   Serial.print("ALARM: ");
   for (i=1; i<ERROR_SIZE;i++){ //skip the position 0 where only indicate there is fault no indication where
     if(errorStatus[i]==1){
       if(first){
         first=false;
       }else{
         Serial.print(",");
       }
       Serial.print(i);
     }
   }
   return;
//   Serial.println();
//   Serial.println();

//   addWrite=storeString(addWrite,"S");   //store letter 'S' GPRS signal to indicate level of signal 0-99
//   addWrite=EEPROMWriteInt(addWrite,currentRadioSig);
//
//   addWrite=storeString(addWrite,"G");              //store letter 'G' to indicate time to acquire signal from GPS after cold/hot start
//   addWrite=EEPROMWriteInt(addWrite,timeGetGPS);
//
//   EEPROMWriteInt(0,addWrite);          //Write last position of memory to write
 }

///****************************************************************************
// * storeLog(byte c )
// * UNO memory 1K
// ****************************************************************************/
// void storeData(byte val){
//  EEPROM.write(addr, val);
//  addr = addr + 1;
//  if (addr == EEPROM.length()) {
//    addr = 0;
//  }
// }


/****************************************************************************
 * boolean connect_GPS(int timeout, int interval)
 * wait GPS acquire signal
 * parameters
 * timeout = max time to check if gps acquired in seconds
 * interval = time between the check of GPSSTATUS command
 * return
 * true or false. true if GPS acquired or false if GPS was not acquired
 ****************************************************************************/
boolean connect_GPS(int timeout, initTime_type t){
  unsigned long timerStart;
  timerStart = millis();
  int interval =5000; //interval to send command AT+CGPSSTATUS?

  //sim808_flush_serial(); //test
  Serial.print("GPS SYNC: ");
  //sim808_check_with_cmd("AT\r\n","OK\r\n",CMD);

  //test if make difference2
  sim808_check_with_cmd("AT+CGNSPWR=1\r\n", "OK\r\n", CMD);
  //delay(1000);


  if(!sim808_check_with_cmd("AT+CGPSPWR=1\r\n","OK\r\n",CMD)){
    setCurrentError(POWER_GPS_FAIL);
    return false;
  }else{
    clearCurrentError(POWER_GPS_FAIL);
  }
  //delay(1000);

  if (t == FIRST_TIME){
    if(!sim808_check_with_cmd("AT+CGPSRST=0\r\n","OK\r\n",CMD)){   //COLD START
      setCurrentError(RESTART_GPS_FAIL);
      return false;
    }else{
      clearCurrentError(RESTART_GPS_FAIL);
      interval = 10000; //interval of 10 seconds to send AT+CGPSSTATUS?

    }
  }else{
    if(t == RUNNING_TIME){
      if(!sim808_check_with_cmd("AT+CGPSRST=1\r\n","OK\r\n",CMD)){ //HOT START
        setCurrentError(RESTART_GPS_FAIL);
        return false;
      }else{
        clearCurrentError(RESTART_GPS_FAIL);
        interval = 5000; //interval of 10 seconds to send AT+CGPSSTATUS?

      }
    }
  }
  //delay(1000);

  while (1){
    sim808_clean_buffer(gprsBuffer,64);
    sim808_send_cmd("AT+CGPSSTATUS?\r\n");
    sim808_read_buffer(gprsBuffer,64,2); //change default timeout to 1s instead of 5s

    //Serial.println(gprsBuffer);

    if(strstr(gprsBuffer,"3D Fix")){
      sim808_clean_buffer(gprsBuffer,64);
      clearCurrentError(GPS_SYNC_FAIL);

      timeGetGPS = ((unsigned long) (millis() - timerStart))/1000UL;
      Serial.println(timeGetGPS);
      return true;
     }

    if ((unsigned long) (millis() - timerStart) > timeout * 1000UL) {
      sim808_clean_buffer(gprsBuffer,64);
      setCurrentError(GPS_SYNC_FAIL);
      Serial.print(((unsigned long) (millis() - timerStart))/1000UL);
      Serial.println(" (timeout)");
      return false;
    }

    delay(interval);
  }
  return false;
 }


/*******************************************
 * Print dot on serial port to indicate
 * elapsed time.
 *******************************************/

void PrintSecondsElapsed(){
//  Serial.print("*");
  //Serial.print("*Seconds: ");
  //Serial.println(seconds);
  seconds++;
}

/******************************************************************************************
 * int SendGPSLocation()
 * return 0  No error, GPRS UP
 *        1 =< Error < 20 see error code initialization of GPRS, see InitGPS() for error code
 *        Error = 20, DNS Failed or weak GPRS signal
 *
 * This procedure open a GPRS data connection and send latitude and longitude for server.
 * After data is sent it disconnect from server.
 * Send data to server using format "latitude,longitude" = "llll.llll,lllll.llll"
 * obs. no \0 at end like string.
 ******************************************************************************************/

fault_type SendGPSLocation(){
  //char data2db[36]="0000.0000,00000.0000,00000.0,000.000"; //"latitude,longitude,MSL_altitude,Speed"
  char data2db[36]="\0"; //"latitude,longitude,MSL_altitude,Speed"
  fault_type error;
  int sendNumber;

  /************************************************************
   * CIPSTATUS result
   * 0 IP STATUS    ready to initiate connection
   * 8 CONNECT OK   ready to send data
   ************************************************************/


