marcelky/GPS-proj/stm32_sim808_eclipse.cpp
//    Serial.print("Buffer2: ");
//    Serial.print(gprsBuffer);
  //get signal strength, if < 7 not possible to send data to server
  sim808_clean_buffer(gprsBuffer,64);
  sim808_send_cmd("AT+CSQ\r\n");
//  delay(100);
//  if(Serial2.available()) {
    sim808_read_buffer(gprsBuffer,64);  //3rd timeout of 1second
    currentRadioSig = getSignalQuality(gprsBuffer);
    Serial.print("SIG:");
    Serial.println(currentRadioSig);
//    Serial.print("Buffer3: ");
//    Serial.print(gprsBuffer);
//  }
  sim808_clean_buffer(gprsBuffer,64);


/*******************************************************************
 * previousRadioSignal currentRadioSignal
 * 0                   0                  nao faz nada e sai
 * 1                   0                  nao faz nada e sai
 * 0                   1                  initGPRS e send data
 * 1                   1                  nao faz nada e send data
 *******************************************************************/
//  //sim808_send_cmd("AT+CIPSTATUS\r\n");
//  if(Serial2.available()) {
//    sim808_send_cmd("AT+CIPSTATUS\r\n");
//    sim808_read_buffer(gprsBuffer,64,DEFAULT_TIMEOUT);
//    //Serial.print(gprsBuffer);
//  }
  if((currentRadioSig <= 7) || (currentRadioSig == 99)) {  // (smaller than 7) signal too weak and (equall 99) could not measure radio signal
       Serial.println("NOGPRSsig");
       //sim808_send_cmd("AT+CDNSGIP=\"ardugps.hopto.org\"\r\n");
       previousRadioSig = currentRadioSig;

       setCurrentError(NO_GPRS_SIGNAL);
       return NO_GPRS_SIGNAL;            //error of weak signal or DNS failed
  }else{                                 //radio signal > 7
    clearCurrentError(NO_GPRS_SIGNAL);
    if(previousRadioSig > 7){            //signal still good
      previousRadioSig = currentRadioSig;
    }else {                              //signal recovered
      error = InitGPRS(RUNNING_TIME);   //errors already logged with setCurrentError(error) inside this InitGPRS
      previousRadioSig = currentRadioSig;
      if(error > 0) {                    //initGPRS failed
//      Serial.print("GPRSfail: ");
//      Serial.println(error);
        return error;
      }
//      Serial.println("GprsInitOK");
    }
  }



  //get the local ip number
  //GPRS.println("AT+CIFSR");
  //if(sim808.readable()) {
  sim808_send_cmd("AT+CIFSR\r\n");
  //}
  delay(50);

  //if(sim808.readable()) {
  sim808_send_cmd("AT+CDNSGIP=\"ardugps.hopto.org\"\r\n");
  //}
  //sim808_flush_serial();
  delay(50);

  //start a connection to TCP to URL and port
  if (prot == TCP){
    if(!SendCIPSTART(TCP)){            //TCP protocol
      setCurrentError(START_GPRS_TCP_FAIL);
      return START_GPRS_TCP_FAIL;      //"AT+CIPSTART => FAIL";
    }
  }else {                              //UDP protocol
    if(!SendCIPSTART(UDP)){
      setCurrentError(START_GPRS_UDP_FAIL);
      return START_GPRS_UDP_FAIL;      //"AT+CIPSTART => FAIL";
    }
  }


  delay(200);

  //copy latitude and longitude to send via TCP server
  memset(data2db,'\0',sizeof(data2db));
  strncpy(data2db,latitude,sizeof(latitude));
  strcat(data2db,",");
  strcat(data2db,longitude);

  strcat(data2db,",");
  strcat(data2db,MSL_altitude);

  strcat(data2db,",");
  strcat(data2db,Speed);

//  Serial.println("valor de data2db: ");
//  Serial.println(data2db);



//  if(!SendDataCIPSEND(data2db,sizeof(data2db))){
//    if(prot == TCP){                  //TCP protocol
//      if(!SendCIPSTART(TCP)){         //Trying to restart TCP protocol
//
//        setCurrentError(START_GPRS_TCP_FAIL);
//        return START_GPRS_TCP_FAIL;
//      }
//
//      //delay(1000);
//      delay(100);
//      if(!SendDataCIPSEND(data2db,sizeof(data2db))){    //Trying to resend TCP data
//
//        setCurrentError(SEND_TCP_DATA_FAIL);
//        return SEND_TCP_DATA_FAIL;                      //"CIPSEND =>RESEND FAIL"
//      }
//
//    }else{                             //UDP protocol
//      setCurrentError(SEND_UDP_DATA_FAIL);
//      return SEND_UDP_DATA_FAIL;
//    }
//  }
  sendNumber = SendDataCIPSEND(data2db,sizeof(data2db));
//  Serial.print("sendNumber: ");
//  Serial.println(sendNumber);
//  Serial.print("data2db: ");
//  Serial.println(data2db);

  if(sendNumber == 0){
  //if((SendDataCIPSEND(data2db,sizeof(data2db)))== 0){
    if(prot == TCP){                  //TCP protocol
      if(!SendCIPSTART(TCP)){         //Trying to restart TCP protocol
        setCurrentError(START_GPRS_TCP_FAIL);
        return START_GPRS_TCP_FAIL;
      }
      //delay(100);
      sendNumber = SendDataCIPSEND(data2db,sizeof(data2db));
      if(sendNumber == 0){   //Trying to resend TCP data
        setCurrentError(SEND_TCP_DATA_FAIL);
        return SEND_TCP_DATA_FAIL;                      //"CIPSEND =>RESEND FAIL"
      }

    }else{                             //UDP protocol
      setCurrentError(SEND_UDP_DATA_FAIL);
      return SEND_UDP_DATA_FAIL;
    }
  }else{
    if(prot == TCP){
      clearCurrentError(SEND_TCP_DATA_FAIL);
    }else{
      clearCurrentError(SEND_UDP_DATA_FAIL);
    }
  }

//  delay(50);

  if (CheckConnectionStatus()) {
    sim808_check_with_cmd("AT+CIPCLOSE\r\n", "CLOSE OK\r\n", CMD);
    //Serial.println("Uno have disconnected from Server");
  }

  clearAllError(); //the routine proceed successfully, no error occured
                   //only place to clear all errors

  return NO_ERROR; // no error on GPRS

}//end procedure

/*************************************************************************************
 * SendCIPSTART()
 *************************************************************************************/
boolean SendCIPSTART (Protocol ptl)
{
  //char bufferC[30];
  //sim808_check_with_cmd(F("AT\r\n"),"OK",CMD);

  if(ptl == TCP) {
    if(!sim808_check_with_cmd("AT+CIPSTART=\"TCP\",\"ardugps.hopto.org\",6789\r\n","OK\r\n",CMD)){
      return false;
    }
    else{
      return true;
    }
  }
  else {
    if(ptl == UDP) {
      sim808_send_cmd("AT+CIPSTART=\"UDP\",\"ardugps.hopto.org\",6789\r\n");
      return true;
    }
    else {
      return false;
    }
  }
}



/*************************************************************************************
 * SendDataCIPSEND()
 * This procedure send data through the wireless connection server.
 *************************************************************************************/

int SendDataCIPSEND(const char * str, int len)
{
  char num[4];
  char command[20]="AT+CIPSEND=";

  itoa(len, num);
  strcat(command,num);
  strcat(command,"\r\n");
  command[sizeof(command)-1] = '\0';
//  Serial.print("command: ");
//  Serial.println(command);

  if(len > 0){
    //sim808_send_cmd("AT+CIPSEND=");
    //sim808_send_cmd(num);
    if(!sim808_check_with_cmd(command,">",CMD)) {
      return 0;
    }
    //delay(100);
    sim808_send_cmd(str);
    //delay(100);
    sim808_send_End_Mark();
    return len;
  }else{
    return 0;
  }












