marcelky/GPS-proj/stm32_sim808_eclipse.cpp
       Speedkmh = atof(Speed);
       Speedkmh = Speedkmh*1.852;
       dtostrf(Speedkmh,3,3,Speed);

       //Serial.print("SPEED  KMH       : ");
       //Serial.println(Speed);

       return true;
     }else {
       if (token == NULL){
         return false;
       }else{
        token = strtok(NULL, ",");
        i++;
       }
     }
   }//while
   return false;
}


/*************************************************************
 * CheckSignalQuality(char *)
 * scan and print the signal quality
 * return 99 unknow or failed to extract
 *        0 to 98 valid result
 * AT+CSQ
 * +CSQ: 21,0
 * OK
 *************************************************************/

int getSignalQuality(char *signalBuffer){
  char *token;
  char sig[3]="99";
  /* get the first token */
  //Serial.println("****************Content of gpsBuffer*******************");
  //Serial.println("bufferCSQ:");
  //Serial.println(signalBuffer);

  //Get Command sent
  token = strtok(signalBuffer,"\n\r" );
  if(token == NULL)  return 99;

  //Get "+CSQ:" string
  token = strtok(NULL, " ");
  if(token == NULL)  return 99;

  //Get +CSQ: value
  token = strtok(NULL, ",");
  if(token == NULL) {
    return 99;
  }else{
    strncpy(sig,token,sizeof(sig));
    sig[sizeof(sig)-1] = '\0';
    return atoi(sig);
  }
}



/********************************************************************************
* GPSAnalyzer128(infoLocation);
* GPZDA
* AT+CGPSINF=128
* at+cgpsinf=128
* +CGPSINF: 128,045140.000,02,11,2017,00,00
* Message ID          : $GPZDA = 128 (ZDA protocol header)
* UTC Time            : hhmmss.sss
* Day                 : Day of month 1-31
* Month               : Month of the year 1-12
* Year                : 1980-2079
* Local zone hour     : hour (offset from UTC set to 0)
* Local zone minutes  : minute (offset from UTC set to 0)
* Checksum            : knots
* <CR><LF>            : end of message
 ********************************************************************************/
boolean GPSAnalyzer128() {
   char *token;
  //delay(8000);  //5000 no GPS data 10 times
  sim808_clean_buffer(gprsBuffer,sizeof(gprsBuffer));
  sim808_send_cmd("AT+CGPSINF=128\r\n");
  sim808_read_buffer(gprsBuffer,55,DEFAULT_TIMEOUT);


   /* get the first token */
//   Serial.println("****************Content of gpsBuffer*******************");
//   Serial.println("valor do buffer :");
//   Serial.println(gprsBuffer);

   //Get Command sent AT_CGPSINF=128
   token = strtok(gprsBuffer,"\n\r" );
   if(token == NULL)  return false;

   //Get "+CGPSINF:" string
   token = strtok(NULL, ":");
   if(token == NULL)  return false;

   //Get CGPSINF value 128
   token = strtok(NULL, ",");

   //Get time and create string of time and date "hhmmss.sss-dd-mm-yyyy";
   token = strtok(NULL, ",");
   if(token != NULL){
       strncpy(startDateTime,token,sizeof(startDateTime)); //Time
       strcat(startDateTime,"-");
   }else{
     return false;
   }

   //Get Day and create string of time and date "hhmmss.sss-dd-mm-yyyy";
   token = strtok(NULL, ",");
   if(token != NULL){
       //strncpy(startDateTime,token,sizeof(startDateTime)); //Time
       strcat(startDateTime,token);
       strcat(startDateTime,"-");
   }else{
     return false;
   }

   //Get Month and create string of time and date "hhmmss.sss-dd-mm-yyyy";
   token = strtok(NULL, ",");
   if(token != NULL){
       //strncpy(startDateTime,token,sizeof(startDateTime)); //Time
       strcat(startDateTime,token);
       strcat(startDateTime,"-");
   }else{
     return false;
   }

   //Get Year and create string of time and date "hhmmss.sss-dd-mm-yyyy";
   token = strtok(NULL, ",");
   if(token != NULL){
       //strncpy(startDateTime,token,sizeof(startDateTime)); //Time
       strcat(startDateTime,token);
       startDateTime[sizeof(startDateTime)-1] = '\0';
   }else{
     return false;
   }

//   Serial.println("startDateTime:");
//   Serial.println(startDateTime);
   return true;
}


/********************************************************************************
* GPVTG
* AT+CGPSINF=64
* +CGPSINF: 64,299.79,T,,M,0.072,N,0.133,K,A
* Message ID    : $CPVTG = 64
* Course        : degrees
* Reference     : TRUE
* Course        : degrees (Measured heading)
* Reference     : M (Magnetc)
* Speed         : knots (Measured horizontal speed)
* Units         : N (Knots)
* Speed         : Km/h (Measured horizontal speed)
* Units         : Kilometers/h
* Mode          : A = Autonomous
*                 D = DGPS
*                 E = DR
*                 N = Output Data Not Valid
*                 R = Coarse Position
********************************************************************************/


///****************************************************************************
// * storeLog(int add, char *val)
// * UNO memory 1K
// * Param
// * add address to write data
// * val value to write
// ****************************************************************************/
// int storeData(int add, byte val){
//  int addTemp;
//  addTemp = add;
//
//  EEPROM.write(add, char(val));
//
//  addTemp = addTemp + 1;
//  if (addTemp == EEPROM.length()) {
//    addTemp = 2;                    //reserve address 0 and 1 to write last position
//   }
//  return  addTemp;
// }
//
///****************************************************************************
// * voi storeString(
// *
// ***************************************************************************/
//int storeString(int add, char *val){
//  int addNext, addCurr;
//  char * name = val;
//  int size = 0;
//
//  while(true)
//  {
//    if(*(val + size) == '\0') // returns 5...
//      break;
//
//     size++;
//  }
//  addCurr=add;
//  addNext = add + size;
//  if (addNext >= EEPROM.length()) { //data do not fit EEPROM
//    addCurr = 2;                     //address 0 and 1 is reserved for lastWriteAddress
//    addNext = addCurr + size;
//  }
//
//  for(int j=0;j<size;j++){
//    EEPROM.write(addCurr,name[j]);
//    addCurr++;
//  }
//  return addNext;
//}
//
///******************************************************************************
// * Routines to write and read integer long 4 bytes max
// * 32,767 hold 2^16 bits
// * Needs 2 bytes
// * ****************************************************************************/
// unsigned int EEPROMWriteInt(int p_address, long p_value)
//  {
//  int addNext, addCurr;
//  byte lowByte0 = ((p_value >> 0) & 0xFF);
//  byte lowByte1 = ((p_value >> 8) & 0xFF);
//
//  addCurr=p_address;
//  addNext = p_address + 2;
//  if (addNext >= EEPROM.length()) { //data do not fit EEPROM
//    addCurr = 2;                     //address 0 and 1 is reserved for lastWriteAddress
//    addNext = addCurr + 2;
//  }
//
//  EEPROM.write(addCurr, lowByte0);
//  EEPROM.write(addCurr + 1, lowByte1);
//
//
//  return addNext;
//  }
//
///******************************************************************************
// * Routines to write and read integer long 4 bytes max
// * 32,767 hold 2^16 bits
// * Needs 2 bytes
// * ****************************************************************************/
//unsigned int EEPROMReadInt(int p_address){
//  byte lowByte0 = EEPROM.read(p_address);
//  byte lowByte1 =  EEPROM.read(p_address + 1);
//  return ((lowByte0 << 0) & (0xFF)) + ((lowByte1 << 8) & (0xFF00));
//  }

